[
    {
        "link": "https://www.youtube.com/watch?v=rhl4wN2a86M",
        "title": "Top 10 Teamwork Skills",
        "description": [
            "CareerGuide.com\n5.17K subscribers\nSUBSCRIBE\nTop 10 Teamwork Skills are\n\n1. Communication\nThe ability to get your point across, and truly understand what other people want to tell you is the cornerstone of effective teamwork\nPlus, the nonverbal aspects of communication are just as important. \n\n2. Conflict resolution\nConflict is part and parcel of any team effort. What matters most is how adept you are at dealing with issues as they arise\n\n3. Rapport-building and listening\nYou can only build rapport if you’re listening to other people’s voices. Rapport and listening skills go hand in hand, one can’t exist without the other.\n\n4. Decision-making\nMaking decisions may seem like a pretty straightforward thing to do. And that's the case when everyone agrees on the course of action. But everything changes when opinions start to differ and you need to make an unpopular decision.\n\n5. Problem-solving\nThe ability to look at an issue from multiple angles and utilize your time management skills on the basis of individual team member’s skills drive the entire team’s performance and success.\n\n6. Organizational and planning skills\nTo solve any problem effectively and efficiently you must be able to devise a master plan that every team member understands, follows, and knows where it leads to.\n\n7. Persuasion and influencing skills\nBeing persuasive isn’t a character trait. It’s a skill you can learn. A good start to build such leadership skills is to hone-in on your presentation skills.\n\n8. Reliability\nShow your reliability by sticking to deadlines, delivering your tasks, and overcommunicating any obstacles along the way.\n\n9. Respectfulness\nBeing respectful towards other people doesn’t mean you have to like them or agree with them. Show your respect by not taking anyone for granted, and listening to them actively Don’t know where to start? Learn your teammates’ names first!\n\n10. Tolerance\nTolerance and respectfulness go hand in hand. Be open-minded and eager to learn. \n\nGetting the right information is crucial in today’s information age. How often it happens when we miss the opportunities due to lack of information. CareerGuide won’t let that happen. \n\nVisit our website and find all the answers.\nhttps://bit.ly/Careerguide_website\n\nGet our app on Playstore:\nhttps://bit.ly/Careerguide_playstore\nSHOW LESS"
        ],
        "views": "7,237 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=_-mP3YKptwQ",
        "title": "Teamwork Skills",
        "description": [
            "Academic Skills, The University of Melbourne\n17.1K subscribers\nSUBSCRIBE\nIn this video, UniMelb students share their thoughts on how to effectively work in teams.\n\nVisit our website for more helpful resources: http://services.unimelb.edu.au/academ...  \n| CONNECT WITH US |\nFACEBOOK: https://www.facebook.com/AcademicSkil...  \nTWITTER: https://twitter.com/AcadSkillsMelb\nSHOW LESS"
        ],
        "views": "505 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=qi9nVpc9gq4",
        "title": "6 Skills of Collaboration",
        "description": [
            "Phi Sigma Pi National Honor Fraternity\n255 subscribers\nSUBSCRIBE\nCollaboration happens every day in your Chapter from planning Recruitment to co-facilitating a Module. Practicing these 6 skills will improve how you collaborate and make you a stronger leader.\n\nTo earn 2 Leadership in Action points email lia@phisigmapi.org with an example of how your Chapter effective collaborated while planning Recruitment or a Tripod event or how your co-workers or organization collaborated on a project.\n\nTo improve your collaboration skills complete the following Leadership in Action Modules:\n\nArt of Effective Communication-Exploring Your Communication Style\nDeveloping Emotional Intelligence-The Road To Resiliency\nStart the Conversation- Positive Conversations in Tough Situations\nDiversity, Equity and Inclusion- Leading the Conversation\nThe Team Foundation-The Winning Combination\nBuilding Trust- The Seeds Of Success \n\nRequest a Module at phisigmapi.org/requestamodule. Learn more about Leadership in Action on our website at phisigmapi.org/lia\nSHOW LESS"
        ],
        "views": "2,902 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=KT2TQGFWcko",
        "title": "GOOD COLLABORATION (2014)",
        "description": [
            "WR Crime Prevention Council\n498 subscribers\nSUBSCRIBE\nThis 2:30 fun animation was produced to support our Collaboration Values Statement (2014) to promote the benefits of Good Collaboration for community partners and organizations."
        ],
        "views": "196,977 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=H_vOfqIpD60",
        "title": "Why Team Building is Important !!",
        "description": [
            "Vinayak Sareen\n132 subscribers\nSUBSCRIBE\nDaily, we come through various exercises or tasks that we found difficult to complete just because of lack of support from our team or guidance from our experienced seniors. There are always some flamboyant mates in the team who try to push the team to excel in the targets and goals but due to hindrance from some negative members, they become unable to achieve what they want.\nEduCorp Trainings has come up with some tested solutions to develop such traits by giving Activity based experiential trainings to leave an enduring effect on the trainee.\nFor further details, Contact us at trainings@educorp.in \nor Visit www.trainings.educorp.in\nSHOW LESS"
        ],
        "views": "44,195 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=Po40I4c94R0",
        "title": "Education- Collaboration",
        "description": [
            "OnSide Learning\n1.37K subscribers\nSUBSCRIBE\nAs we educate our students for the 21st century, we must teach them some vital skills to succeed. This video explains  what  collaboration is and why it important for both teachers and students to collaborate more in and outside of the school setting.\n\nFor part 2 of the video please visit www.onsidelearning.com\nSHOW LESS"
        ],
        "views": "140,192 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=hHIikHJV9fI",
        "title": "Secrets Of Successful Teamwork: Insights From Google",
        "description": [
            "Coding Tech\n639K subscribers\nSUBSCRIBE\nSeveral years ago, Google launched a big study to figure out what makes teams successful. Watch this video to find out what conclusions the researchers arrived to after studying more than 180 separates teams for the duration of several years.\n\n***\nINTERESTED IN THE STOCK MARKET?\nI developed a profitable stock market trading model. Information can be found here: https://bit.ly/3esse3R\n\n***\nThe World's Top Billionaires (2000 - 2021): https://www.youtube.com/watch?v=20kZ6...\nSHOW LESS"
        ],
        "views": "372,132 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=eRODwOqrAIg",
        "title": "Charles Duhigg Asks: What Makes a Great Team?",
        "description": [
            "Penguin Random House Audio\n5.83K subscribers\nSUBSCRIBE\nHow do teams work together and achieve success? Charles Duhigg, author of SMARTER FASTER BETTER looks at SNL and Google to find out. Learn more about his books at charlesduhigg.com."
        ],
        "views": "40,648 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=kYjqtLCNqSA",
        "title": "5 Reasons Why Effective Teamwork is Important for all Organisations",
        "description": [
            "Potential\n14.8K subscribers\nSUBSCRIBE\nTeamwork is a term used for joining the efforts of bringing members in a project or business together to achieve a common goal. The members of the teamwork together effectively as a group with the aim of increasing productivity and performance.\n\nIn this video, we will explain the 5 reasons why effective teamwork is essential in any organization.\n\n#Teamwork #ImportanceOfTeamwork #WhatIsTeamwork #Business #RealWorldEd #Potential\n\nEmpower Yourself with more Practical Business Education to Reach your Potential by visiting our site: https://www.potential.com/\nSHOW LESS"
        ],
        "views": "202,742 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=1sSing6ntVA",
        "title": "How to Improve your Teamwork Skills instead of Stressing Out by Peer Connect",
        "description": [
            "I Time Travel Well\n34 subscribers\nSUBSCRIBE\nA short video animation by a group of students at George Brown College showcasing tips and ideas on how to improve your teamwork and increase productivity in collaborative group projects. By looking at two key elements; students, employees, or anyone working in a collaborative setting can focus on not only becoming a better team player but also how to ensure you have a strong and healthy team.\n\n\nVoice-over by Laura McMullan\nGraphics by Natalie Shum & Anastasia Maslov\nAnimation by Charles Jackson\nSHOW LESS"
        ],
        "views": "12,297 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=n_UhsBZNADM",
        "title": "5 Tips For Effective Teamwork",
        "description": [
            "Rebel Monkey\n559 subscribers\nSUBSCRIBE\nEffective teamwork is the key to a successful business, as it increases productivity levels and produces better solutions to problems. Companies that foster a friendly and collaborative work environment will be the ones to succeed in the business world.\n\nNeed and Explainer Video? Contact Us - info@rebelmonkey.pro\nhttps://www.rebelmonkey.pro\n\nTry sowing a few of these seeds in your organization, find out which ones serve you best, and reap the harvest of stronger teamwork.\nSHOW LESS"
        ],
        "views": "4,404 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=lmwmg4pwdBc",
        "title": "Collaborating at work: The collaboration skills you need to succeed",
        "description": [
            "Ashridge Executive Education\n1.76K subscribers\nSUBSCRIBE\nMore work inside organisations is done through collaboration rather than close teams.  Here is how to be good at this way of working."
        ],
        "views": "18,350 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=vradYqcXfGQ",
        "title": "How to Collaborate Effectively If Your Team Is Remote (The Explainer)",
        "description": [
            "Harvard Business Review\n358K subscribers\nSUBSCRIBE\nCoronavirus could force your team to work remotely. Here's how to do it right.\n\n\n\nWhy do remote teams demand new collaboration skills? What’s missing from our texts, emails, conference calls, and other digital communications? Body language. Even when we’re co-located, the tone of a text or the formality of an email is left wide open to interpretation, to the point that even our closest friends get confused. These misinterpretations create an anxiety that can become costly, affecting morale, engagement, productivity, and innovation.\n\nRemote communication can distort the normal pace of our conversations. The delay between our messages can often postpone or hide emotional reactions to our comments. Lacking an immediate response, we can become distracted, second-guess ourselves, or even grow frustrated with our teams.\n\nTo perform at the highest levels, remote teams have to find new and better ways to operate.\n\n---------------------------------------------------------------------\n\nAt Harvard Business Review, we believe in management. If the world’s organizations and institutions were run more effectively, if our leaders made better decisions, if people worked more productively, we believe that all of us — employees, bosses, customers, our families, and the people our businesses affect — would be better off. So we try to arm our readers with ideas that help them become smarter, more creative, and more courageous in their work. We enlist the foremost experts in a wide range of topics, including career planning, strategy, leadership, work-life balance, negotiations, innovation, and managing teams. Harvard Business Review empowers professionals around the world to lead themselves and their organizations more effectively and to make a positive impact.\n\nSign up for Newsletters: https://hbr.org/email-newsletters\n\nFollow us:\nhttps://hbr.org/\nhttps://www.linkedin.com/company/harv...\nhttps://www.facebook.com/HBR/\nhttps://twitter.com/HarvardBiz\nhttps://www.instagram.com/harvard_bus...\nSHOW LESS"
        ],
        "views": "109,211 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=95x3HhKlLII",
        "title": "Teamwork: 5 Steps Put Together a Great Team",
        "description": [
            "Potential\n14.8K subscribers\nSUBSCRIBE\nDeveloping a great team helps to combine a group of talents efficiently to reach a common goal. Here are 5 steps for creating a great team.\n\n1- Acknowledge the different skills in your team\n2- Teamwork needs diversity\n3- Don’t be a boss \n4- Verify Progress \n5- Gratitude \n\n#GreatTeam #Teamwork #Business #RealWorldEd #Potential\n\nEmpower Yourself with more Practical Business Education to Reach your Potential by visiting our site: https://www.potential.com/\nSHOW LESS"
        ],
        "views": "10,955 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=6nfnuwN4p5Y",
        "title": "Team building - 5 tips for enhancing teamwork and productivity",
        "description": [
            "Potential\n14.8K subscribers\nSUBSCRIBE\nTeam building is essential in work, school, and sports. Developing effective teams will help boost productivity, innovation, and well-being. \n\nCheck out the video to: \n- See some statistics about the positive impact of team building \n- Get tips on how to develop strong and effective teams\n- Watch out for common mistakes \n\nWe would love to hear your tips and suggestions for better team building. The best inputs would be rewarded. So let us hear your team building and teamwork tips in the comments below. \n\n--------------------------------------------------------------------\n#Teamwork #TeamBuilding #Potential\n\nCheck out our practical business tips playlist: https://www.youtube.com/playlist?list...\n\nEmpower Yourself to Reach your Potential by visiting our site: https://www.potential.com/\nSHOW LESS"
        ],
        "views": "3,614 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=Y4cgcJ_Y1V8",
        "title": "4 tips to leading a collaborative teamwork environment",
        "description": [
            "Character Quest\n1.28K subscribers\nSUBSCRIBE\n4 tips to leading a collaborative teamwork environment ||\n\nAre you looking to boost collaboration on your team? That takes LEADERSHIP and TEAMWORK. It’s time to increase the effectiveness of your business by creating the enabling conditions that encourage teamwork. Your communication skills really matter here to make the application of this video a success. This also works with remote workers and remote teams that wfh. This training video pulls research from harvard business review to give you the work tips you need for team productivity. This is designed for managers, supervisors looking for team building. \n\ncollaborative, teamwork environment, leadership, collaboration, teamwork, team, business, team communication, communication skills, leadership skills, success, coronavirus, wfh, training, team work, work, communication, work from home, harvard, harvard business review, harvard business school, harvard university, work tips, team collaboration, team productivity, managers, supervisors, attitude, creativity, team building, derek matthews phd, derek matthews, avengers, infinity war, thanos, black widow, hulk, spiderman, ironman, character quest.\nSHOW LESS"
        ],
        "views": "95 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=-KflXKhN2Uc",
        "title": "5 Zoom, Virtual, or Team Building Activities: [IDEAS FOR VIRTUAL OR REMOTE TEAMS]",
        "description": [
            "Quick Team Building Activities\n4.17K subscribers\nSUBSCRIBE\nIn this video, we talk about five Zoom, virtual, or team building activities that you can apply for your next virtual event. \n\nSubscribe: https://www.youtube.com/channel/UCbNs...\nFacebook: https://www.facebook.com/pages/Quick-...  \nWebsite:http://www.quickteambuildingactivitie...\nVine : https://vine.co/u/1135409546991677440\n\nAlso, check out this video - https://www.youtube.com/watch?v=-KflX...\n\nHappy planning!\nSHOW LESS"
        ],
        "views": "130,678 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=mlBpcXPlFFI",
        "title": "Collaboration vs. Cooperation: Why it matters.",
        "description": [
            "MindSage\n145 subscribers\nSUBSCRIBE\nYou can have the best grades,  the highest GPA, and the highest SAT scores - but it's all useless if you can't collaborate with others.\n\nIn this micro-lesson, we examine why employers look for (and keep) employees that know how to collaborate, and why school can make it difficult to learn how to collaborate.\n\nwww.mindsage.org\nSHOW LESS"
        ],
        "views": "1,046 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=gCfzeONu3Mo",
        "title": "How miscommunication happens (and how to avoid it) - Katherine Hampsten",
        "description": [
            "TED-Ed\n14.7M subscribers\nSUBSCRIBE\nView full lesson: http://ed.ted.com/lessons/how-to-avoi...\n\nHave you ever talked with a friend about a problem, only to realize that he just doesn’t seem to grasp why the issue is so important to you? Have you ever presented an idea to a group, and it’s met with utter confusion? What’s going on here? Katherine Hampsten describes why miscommunication occurs so frequently, and how we can minimize frustration while expressing ourselves better. \n\nLesson by Katherine Hampsten, animation by Andrew Foerster.\nSHOW LESS"
        ],
        "views": "1,334,081 views",
        "category": "Collaboration and Teamwork"
    },
    {
        "link": "https://www.youtube.com/watch?v=z-XdGPKF75k",
        "title": "Top 10 Tips For A Successful Teamwork",
        "description": [
            "Top 10\n1.62K subscribers\nSUBSCRIBE\nIn this channel we will tell u about the Top 10 tips for a successful teamwork"
        ],
        "views": "6,902 views",
        "category": "Collaboration and Teamwork"
    }
]
