[
    {
        "link": "https://www.youtube.com/watch?v=aozlwC3XwfY",
        "title": "Who Even Is An Entrepreneur?: Crash Course Business - Entrepreneurship #1",
        "description": [
            "CrashCourse\n12.6M subscribers\nSUBSCRIBE\nYou've probably heard the word \"Entrepreneur\" thrown around a lot in business. It conjures images of Elon Musk, Bill Gates, or Oprah Winfrey. But, it goes way beyond that. In this episode of Crash Course Business: Entrepreneurship, Anna helps us to figure out who Entrepreneurs are, and what that title actually means.\n\n\n***\n\nCrash Course is on Patreon! You can support us directly by signing up at http://www.patreon.com/crashcourse\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\n\nEric Prestemon, Sam Buck, Mark Brouwer, Timothy J Kwist, Brian Thomas Gossett, Haxiang N/A Liu, Jonathan Zbikowski, Siobhan Sabino, Zach Van Stanley, Bob Doye, Jennifer Killen, Nathan Catchings, Brandon Westmoreland, dorsey, Indika Siriwardena, Kenneth F Penttinen, Trevin Beattie, Erika & Alexa Saur, Justin Zingsheim, Jessica Wode, Tom Trval, Jason Saslow, Nathan Taylor, Khaled El Shalakany, SR Foxley, Sam Ferguson, Yasenia Cruz, Eric Koslow, Caleb Weeks, Tim Curwick, David Noe, Shawn Arnold, William McGraw, Andrei Krishkevich, Rachel Bright, Jirat, Ian Dundore\n--\n\nWant to find Crash Course elsewhere on the internet?\nFacebook - http://www.facebook.com/YouTubeCrashC...\nTwitter - http://www.twitter.com/TheCrashCourse\nTumblr - http://thecrashcourse.tumblr.com \nSupport Crash Course on Patreon: http://patreon.com/crashcourse\n\nCC Kids: http://www.youtube.com/crashcoursekids\nSHOW LESS"
        ],
        "views": "610,202 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=92ZmzD70sOU",
        "title": "What is an entrepreneur?",
        "description": [
            "Business Wales/Busnes Cymru\n19.2K subscribers\nSUBSCRIBE\nhttp://businesswales.gov.uk/bigideas/\nThe folk at Big Ideas Wales know that there's no one better to tell you what's an entrepreneur and the skills you'll need than: entrepreneurs. So they asked some, and here's what they had to say...\n\nAttitude, creativity, organisation and relationships were the 4 key points that make a successful entrepreneur:\n\nHaving a positive attitude will get you a long way.\n\nAll you need is a bit of imagination and the ability to think a bit differently and BINGO, you’ve come up with a brilliant new idea.\n\nTo get to grips with the day to day running of things good organisation is essential.\n\nRunning a business is definitely a people thing. The more people you know the easier it will be to use your powers of persuasion and get things done.\nhttp://business.wales.gov.uk/bigideas/\nSHOW LESS"
        ],
        "views": "404,692 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=njVnaQmtfOE",
        "title": "Story of an Entrepreneur",
        "description": [
            "Rolling Arrays - The Trusted HR Transformation Partner\nSUBSCRIBE\nThis video is a true testatment of how with true passion & hard work you can truly change your dreams into reality. Believing in yourself & your dreams is the key to success.\nAt Rolling Arrays we are Always in Motion!!\n\nThe Story behind Rolling Arrays  #passion   #dreams   #alwaysinmotion   #believeinyourdreams   #success   #achievements\nSHOW LESS"
        ],
        "views": "7,312 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=s6cPmBSL-OQ",
        "title": "Qualities of an Entrepreneur",
        "description": [
            "BGC Canada\n1.03K subscribers\nSUBSCRIBE\nMost entrepreneurs have some specific qualities, and in this podcast we will look at some of those qualities of entrepreneurs!"
        ],
        "views": "63,303 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=n0KRT3Daloc",
        "title": "Mark Zuckerberg Advice to Aspiring Entrepreneurs",
        "description": [
            "Goldvilla Services\nSUBSCRIBE\nDon't set out to build a company, he advised. Rather, \"start with the problem that you're trying to solve in the world. … The best companies that get built are things that are trying to drive some kind of social change, even if it's just local in one place.\"\n#startsmall\nSHOW LESS"
        ],
        "views": "41,104 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=JzHLIXbqlOU",
        "title": "5 Women Entrepreneurs Share Their Secrets To Success | Refinery29",
        "description": [
            "Refinery29\n3.04M subscribers\nSUBSCRIBE\nMeet the female entrepreneurs changing the face of business. They're showin' us their secrets to success and we're HERE for it. \n\nLearn more: http://refinery29.com/female-ceo-entr...\n\nThe Female Entrepreneurs In This Video:\nAuthor of The Big Life\nhttps://instagram.com/annshoket\nFounder Of Bobbi Brown \nhttps://instagram.com/justbobbibrown\nFounder & CEO of Uncharted Play \nhttps://instagram.com/jessomatt\nCo-founder of Rent The Runway https://instagram.com/jennycarterfleiss\nFounder & CEO of NewME\nhttps://instagram.com/abenton\nFounder of Stash Wealth\nhttps://instagram.com/stashwealth\n\nABOUT REFINERY29 \nRefinery29 is a modern woman's destination for how to live a stylish, well-rounded life. http://refinery29.com/\n\nRELATED VIDEOS\n5 Minute Tricks To Massive Productivity https://www.youtube.com/watch?v=L_5_x...\n5 Ways To Rejuvenate Yourself\nhttps://www.youtube.com/watch?v=49qgV...\n5 Days Of Self-Love\nhttps://www.youtube.com/watch?v=65rq1...\n\nSEE MORE REFINERY29 VIDEOS\nhttp://refinery29.com/video\n\nSUBSCRIBE TO REFINERY29\nSubscribe to the Refinery29 channel: http://bit.ly/subscribe-to-r29\nFor the latest trends and videos, visit: http://refinery29.com\nLike Refinery29 on Facebook: https://facebook.com/refinery29\nFollow Refinery29 on Twitter: https://twitter.com/refinery29\nHeart Refinery29 on Instagram: https://instagram.com/refinery29/\nSHOW LESS"
        ],
        "views": "1,036,532 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=ndZcH-Ze738",
        "title": "Life Lessons by Women Entrepreneurs | Best Motivational Video | Oprah Winfrey | Indra Nooyi",
        "description": [
            "Startup Stories\n498K subscribers\nSUBSCRIBE\nLife Lessons by Women Entrepreneurs - Startup Stories brings to you some of the best life lessons by highly renowned women entrepreneurs and motivational speakers, such as Oprah Winfrey, Indra Nooyi, Sara Blakely, Malala Yousafzai and many more! In this best life lessons video, we show you what it took for these leaders of the world to accomplish their goals and become some of the most powerful women in the world today! Here are some of the life lessons they have for us.\n\nStay tuned to Startup Stories for more inspirational and motivational stories. \n\nTop 5 Women Entrepreneurs - https://youtu.be/3ITLS5tYxoo\n\nTop five entrepreneurship lessons: https://youtu.be/e1rEHiuDtuc\n\nFacebook: https://www.facebook.com/StartupStori...\n\nTwitter: https://twitter.com/stories_startup\n\nInstagram: https://www.instagram.com/startupstor...\n\nSubscribe to us on: https://www.startupstories.in/\nSHOW LESS"
        ],
        "views": "84,021 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=hzoGnCdQadw",
        "title": "Ep 4: Evolution in Entrepreneurship | Innovation and Entrepreneurship | SkillUp",
        "description": [
            "Swiss Learning Exchange\n3.62K subscribers\nSUBSCRIBE\nEntrepreneurship has constantly evolved over the years, always bringing innovations - from the caveman who invented the wheel to the digital and internet revolution in the 21st century.\n\nWatch our videos that are focused on the areas of Digital Skills, Entrepreneurship and Innovation, SkillUp Central provides learning opportunities that will help you or your company adapt to the modern world.  Work with Skill-Up Central if your company needs and wants to develop new skills in order to face new challenges. We will work with your qualification specifications to create a training plan especially for you.  \n\nThe aim is to provide you with the new skills required by digitization, automation and the evolution of organizational processes within companies.  \n\nYou can begin your learning journey by engaging with our videos. Leave a comment. You can like and share our videos, subscribe to our channel (click on the bell icon too). If you want even more, here are more things for you to do: \n\nGo to our online platform and do a quiz on skills for the future! \nTake a free course on skills, innovation and entrepreneurship! \nTest your knowledge on digital skills via a free online assessment.  \nAsk questions about jobs of the future and join the online community \n\nFind out how you requalify with new age skills along with a global community. To access the community and to test your new skills visit: https://hubs.ly/H0vNRxp0\n\nFor reading more blogs and insights on SkillUp Central visit: https://corp.skillupcentral.com/ \n\nRequests for sharing this video, please contact us by email: info@slxlearning.com If you would like us to create a video like this one for you, please contact us by email : studios@slxleaning.com \n\n\n#FreeOnlineCourses  #FreeOnlineCoursesSwissVET #SkillDevelopment #Jobs\nSHOW LESS"
        ],
        "views": "1,014 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=MdNNGfoxrqA",
        "title": "What is Entrepreneurship? definition, characteristics and entrepreneurial process",
        "description": [
            "Key Differences\n73.2K subscribers\nSUBSCRIBE\nIn this video, we have explained the meaning of entrepreneurship in an elaborated manner. Additionally, we have also described the meaning of entrepreneur along with the qualities of an entrepreur. Further, in this video the characteristics of entrepreneurship is discussed. The video ends with discussing the entreprenurial process.\nSHOW LESS"
        ],
        "views": "108,629 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=q7K9RXqAK6s",
        "title": "Entrepreneurship - the Entrepreneur",
        "description": [
            "Council for Economic Education\nSUBSCRIBE\nTeach your students about the benefits of being an entrepreneur. In this video a young woman starts her own business cleaning garages and does so well that she is able to expand her business. This video can be shown along side the lessons from the Entrepreneurship Economics publication.\nSHOW LESS"
        ],
        "views": "24,238 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=9wum9XiO4bM",
        "title": "Do you have for it takes to be an entrepreneur? The 5 skills to get you there!",
        "description": [
            "Cuttles\n46 subscribers\nSUBSCRIBE\nHave you ever asked yourself the question: What does it take to be an entrepreneur? We have! So in this video, we will show you five traits that every successful entrepreneur needs. You will learn why they are so important if you want your startup to succeed. \n\nIs 'quirky' part of the job description for entrepreneurs?\nHave you ever heard those stories about successful entrepreneurs with all sorts of quirky habits that should explain why they have become the huge successes they are? Like wearing the same clothes every single day. Or breaking their days down into five-minute intervals. Or reading 50 books a year.\n\nAnd have you ever thought that if that's what it takes to become an entrepreneur, you're probably better suited for a day job? No need to give up just yet. While quirky habits make good stories and probably work for Zuckerberg, Musk, and Gates, you can be a great entrepreneur and still change up your wardrobe every once in a while.\n\nSo do you have what it takes to become an entrepreneur?\nThe fact that you have thought to yourself, \"I want to be an entrepreneur,\" is already a pretty clear sign. And there's not just one right recipe for what makes a good entrepreneur.\n\nThere are some skills, though, that will give you an advantage in the startup game. A good first step to take is to touch base with those skills.\n\nSkill #1: You know how to act\n- Partner up\n- Write a solid business plan\n- Prioritize your work and plan your days\n\nSkill #2: You’re not afraid to fail, and you get back up - every time\n- Accept that failure is inevitable\n- Know how to get back up\n\nSkill #3: You care about the problem\n- Be curious\n- Find out what pisses you off\n\nSkill #4: You’re motivated - and keep going when you’re not\n- Remember why you started\n- Action builds motivation\n\nSkill #5: You’re okay with uncertainty and willing to take risks\n- Prepare for challenges and be ready to pivot\n- Know the unknowns\n\nIf you want more information of the skills and steps, you can read our full course in our Startup Academy https://www.cuttles.io/startup-academ.... We'll walk you through the most important entrepreneurial skills and show you how to become a successful entrepreneur. And if they're not part of your DNA already, we will teach you how to work them up. You'll also get more details on the 12 tips you can use to work up those skills, even if they aren't really in your nature.\nSHOW LESS"
        ],
        "views": "870 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=5hL66Xl6W6M&list=RDQMvhOy4TPVUJk&start_radio=1",
        "title": "What Can You Learn from Your Competition?: Crash Course Business Entrepreneurship #4",
        "description": [
            "CrashCourse\n12.6M subscribers\nSUBSCRIBE\nWe’re used to competitions with clear winners and losers: baseball games, math olympiads, pie-eating contests, and games involving thrones. We crown a victor and everyone else goes home empty-handed! \n\nIn business, though, there isn’t just one winner. So as entrepreneurs, we have to take stock in the middle of the competition, and ask the question: “how competitive am I?”\n\n\n***\n\nCrash Course is on Patreon! You can support us directly by signing up at http://www.patreon.com/crashcourse\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\n\nEric Prestemon, Sam Buck, Mark Brouwer, Timothy J Kwist, Brian Thomas Gossett, Haxiang N/A Liu, Jonathan Zbikowski, Siobhan Sabino, Zach Van Stanley, Bob Doye, Jennifer Killen, Nathan Catchings, Brandon Westmoreland, dorsey, Indika Siriwardena, Kenneth F Penttinen, Trevin Beattie, Erika & Alexa Saur, Justin Zingsheim, Jessica Wode, Tom Trval, Jason Saslow, Nathan Taylor, Khaled El Shalakany, SR Foxley, Sam Ferguson, Yasenia Cruz, Eric Koslow, Caleb Weeks, Tim Curwick, David Noe, Shawn Arnold, William McGraw, Andrei Krishkevich, Rachel Bright, Jirat, Ian Dundore\n--\n\nWant to find Crash Course elsewhere on the internet?\nFacebook - http://www.facebook.com/YouTubeCrashC...\nTwitter - http://www.twitter.com/TheCrashCourse\nTumblr - http://thecrashcourse.tumblr.com \nSupport Crash Course on Patreon: http://patreon.com/crashcourse\n\nCC Kids: http://www.youtube.com/crashcoursekids\nSHOW LESS"
        ],
        "views": "127,998 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=j7wZogQhmFE",
        "title": "YOUNG ENTREPRENEURS SUCCESS Story - Motivational Video",
        "description": [
            "Young Entrepreneurs Forum\n698K subscribers\nSUBSCRIBE\nThe great motivational video on young entrepreneurs success story. The Best Motivational Story of Guest House Young Entrepreneur.\n\nJoin our Young Entrepreneurs Forum - http://www.youngentrepreneursforum.com/\n#youngentrepreneursforum\n\nEvery business starts with Ideas and how to convert that ideas in to making money is depends upon how you work on which direction. So, this Bible of Young Entrepreneurs Success guide helps you to get success in Entrepreneurship. \n\nFew Videos You May Like To Watch.\n\nHow To Start an Online Business - https://www.youtube.com/watch?v=TCtQu...\n\nAre you an Entrepreneur? - https://www.youtube.com/watch?v=b21yt...\n\nTop 40 Small Business Ideas in India - https://www.youtube.com/watch?v=z_Ivo...\n\n5 Questions Before Starting Your Own Business -\nhttps://www.youtube.com/watch?v=PKNka...\n\n10 Tips for Starting Your Own Business - https://www.youtube.com/watch?v=wxyGe...\n\nHow to Start Bookkeeping For Small Business - https://www.youtube.com/watch?v=lDMOf...\n\nThis  video represent the story of young entrepreneurs success guide by following great eBook - The Young Entrepreneur's Guide to Starting and Running a Business: Turn Your Ideas into Money! In this eBook you'll learn about how to change hobbies, skilles and interests into profit-making business and success. It is a bible of entrepreneurship. Also, if you know any young entrepreneurs organization then, comment below. \n\nBrand New Twitter Page - https://twitter.com/entrepreneur600\n\nBrand New FaceBook Page of Young Entrepreneurs - https://www.facebook.com/Young-Entrep...\nSHOW LESS"
        ],
        "views": "189,375 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=Ogce5D2XMZ0",
        "title": "How I became an entrepreneur at 66 | Paul Tasner",
        "description": [
            "TED\n19.9M subscribers\nSUBSCRIBE\nIt's never too late to reinvent yourself. Take it from Paul Tasner -- after working continuously for other people for 40 years, he founded his own start-up at age 66, pairing his idea for a business with his experience and passion. And he's not alone. As he shares in this short, funny and inspirational talk, seniors are increasingly indulging their entrepreneurial instincts -- and seeing great success.\n\nCheck out more TED Talks: http://www.ted.com\n\nThe TED Talks channel features the best talks and performances from the TED Conference, where the world's leading thinkers and doers give the talk of their lives in 18 minutes (or less). Look for talks on Technology, Entertainment and Design -- plus science, business, global issues, the arts and more.\n\nFollow TED on Twitter: http://www.twitter.com/TEDTalks\nLike TED on Facebook: https://www.facebook.com/TED\n\nSubscribe to our channel: https://www.youtube.com/TED\nSHOW LESS"
        ],
        "views": "178,980 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=iqF0Tkhq_VI",
        "title": "Entrepreneurship 2021 - 7 Signs of Entrepreneurship",
        "description": [
            "Young Entrepreneurs Forum\n698K subscribers\nSUBSCRIBE\nEntrepreneurship - 7 Qualities Required to Become Successful Entrepreneur in 2021. \n7 Types of Entrepreneurial Skills. \nQualities of an entrepreneurship that you must know before running your own company. Like, share and subscribe our young entrepreneurs forum channel to get future videos.\n\n#entrepreneurship\n\nThanks for watching this video.\nSHOW LESS"
        ],
        "views": "2,287 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=8mU-hhs242Q",
        "title": "Empowering Women in Business & Management (long version)",
        "description": [
            "International Labour Organization\n172K subscribers\nSUBSCRIBE\nWorldwide there is a growing recognition that more women in senior management and corporate governance makes good business sense. As a result there is increased demand for women in top management roles, for those who can start and successfully run their own businesses and a growing pool of talented women ready to take on the challenges.\n\nBut how can companies change their cultures and hierarchies to meet the demand? And how can employers' organizations best advise them to make it happen?\nSHOW LESS"
        ],
        "views": "4,921 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=ngYNscgi9tc",
        "title": "How To SUCCEED in Business | 6 SECRET STEPS",
        "description": [
            "Young Entrepreneurs Forum\n698K subscribers\nSUBSCRIBE\nIntroducing how to succeed in business. 6 Secret steps to success.\nPart 2 - How to achieve your dreams in real life - https://www.youtube.com/watch?v=wHwxR...\n\nHello friends, We are again uploading our old video in this new updated manner. In this video we are going to teach you how to stay motivated and start your business effectively.\n\nIf you are running your business or want to startup your new business then, you should need to understand these 6 secret steps to succeed in business.\n\nIf you found any questions for starting your own business then, we are here to solve your questions. Do you know, there are thousands of articles are well written for starting a small business or service. Just you need to research it and begin with best tools and business plan.\n\nEarnest by Kevin MacLeod is licensed under a Creative Commons Attribution license (https://creativecommons.org/licenses/...)\nSource: http://incompetech.com/music/royalty-...\nArtist: http://incompetech.com/\n\nThanks for watching how to succeed in business & 6 secret steps to get success.\nSHOW LESS"
        ],
        "views": "137,173 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=YEhhqqCFxog",
        "title": "Successful entrepreneurship characteristics in Plain English",
        "description": [
            "Greg Z Fainberg\n224 subscribers\nSUBSCRIBE\nSample video of Information Design Studio's upcoming Business Library Collection. \n\nCharacteristics of successful entrepreneurs.\n\nVideo Designed and Developed by Amber Myers and Story created by Greg Z Fainberg.\n\nTo learn more about Information Design Studio please visit us on: \n\nhttp://www.infodesign.co.za\nSHOW LESS"
        ],
        "views": "22,105 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=D_hSJvGjnPU",
        "title": "Basic introduction about entrepreneurship",
        "description": [
            "S.A.C Animation Girl\n143 subscribers\nSUBSCRIBE\nbasic introduction about entrepreneurship-- Created using PowToon -- Free sign up at http://www.powtoon.com/youtube/ -- Create animated videos and animated presentations for free.  PowToon is a free tool that allows you to develop cool animated clips and animated presentations for your website, office meeting, sales pitch, nonprofit fundraiser, product launch, video resume, or anything else you could use an animated explainer video. PowToon's animation templates help you create animated presentations and animated explainer videos from scratch.  Anyone can produce awesome animations quickly with PowToon, without the cost or hassle other professional animation services require.\nSHOW LESS"
        ],
        "views": "31,544 views",
        "category": "Entrepreneurship"
    },
    {
        "link": "https://www.youtube.com/watch?v=Rz_BDmUEQlo",
        "title": "BS in Entrepreneurship",
        "description": [
            "UNCG Online\n39 subscribers\nSUBSCRIBE\nLearn about UNCG Online's Bachelor's in Entrepreneurship."
        ],
        "views": "1,467 views",
        "category": "Entrepreneurship"
    }
]
