[
    {
        "link": "https://www.youtube.com/watch?v=-eEBuqwY-nE",
        "title": "What is Critical Thinking?",
        "description": [
            "GCFLearnFree.org\n774K subscribers\nSUBSCRIBE\nIn this video, you’ll strategies to improve your critical thinking skills. Visit https://edu.gcfglobal.org/en/problem-... to learn even more.\n\nWe hope you enjoy!\nSHOW LESS"
        ],
        "views": "158,196 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=m2eINI4WXkc&list=RDCMUCeYUHG6o0YguM-g23htdsSw&index=2",
        "title": "Using Brain Teasers to Build Critical Thinking Skills",
        "description": [
            "GCFLearnFree.org\n774K subscribers\nSUBSCRIBE\nIn this video, you’ll learn more about critical thinking with brain teasers. Visit https://edu.gcfglobal.org/en/problem-... to learn even more.\n\nWe hope you enjoy!\nSHOW LESS"
        ],
        "views": "118,549 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=5VX7sojco3s&list=RDCMUCeYUHG6o0YguM-g23htdsSw&index=3",
        "title": "How Critical Thinking Can Change the Game",
        "description": [
            "GCFLearnFree.org\n774K subscribers\nSUBSCRIBE\nThis video portrays a real-life example of the effects that critical thinking can have on the outcome of a situation. Visit https://edu.gcfglobal.org/en/problem-... for the written lesson. We hope you enjoy!"
        ],
        "views": "28,209 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=dItUGF8GdTw",
        "title": "5 tips to improve your critical thinking - Samantha Agoos",
        "description": [
            "TED-Ed\n14.7M subscribers\nSUBSCRIBE\nView full lesson: http://ed.ted.com/lessons/5-tips-to-i...\n\nEvery day, a sea of decisions stretches before us, and it’s impossible to make a perfect choice every time. But there are many ways to improve our chances — and one particularly effective technique is critical thinking. Samantha Agoos describes a 5-step process that may help you with any number of problems. \n\nLesson by Samantha Agoos, animation by Nick Hilditch.\nSHOW LESS"
        ],
        "views": "7,856,006 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=kaCIycmx8NA",
        "title": "What is Critical Thinking and 7 Reasons Why Critical Thinking is Important",
        "description": [
            "Potential\n14.8K subscribers\nSUBSCRIBE\nIn this video, you will learn what is critical thinking and why is it important in our everyday lives. \n\n#CriticalThinking #BusinessTips #Potential #RealWorldEd #WhatIsCriticalThinking\n\nEmpower Yourself with more Practical Business Education to Reach your Potential by visiting our site: http://www.potential.com\nSHOW LESS"
        ],
        "views": "56,274 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=-wgqq-fwIKw",
        "title": "What is Critical Thinking (and Why Should I Care)?",
        "description": [
            "SAGE Students\n1.7K subscribers\nSUBSCRIBE\nCritical thinking means being able to think for yourself; to ask what is really going on in the world; to see through others’ efforts to manipulate you.  It’s also a set of skills that can be taught and practiced.  \n\nCritical Thinking by Tom Chatfield provides a power pack of resources, teaching you what critical engagement is, and what thinking and writing skills you need to master in order to develop clear, confident writing and succeed in your essays and coursework at university - and beyond.\n\nFind out more about Critical Thinking by Tom Chatfield at https://uk.sagepub.com/en-gb/eur/crit... \nFollow Tom at https://twitter.com/TomChatfield \nSearch online for #TalkCriticalThinking to join the conversation.\n\nTom Chatfield is a British writer, broadcaster and tech philosopher. He’s interested in improving our experiences of digital technology, and better understanding its use through critical thought. His six books exploring digital culture have appeared in over two dozen countries and languages. He lives near London with his family.\nSHOW LESS"
        ],
        "views": "28,099 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=PhV361MB0fg",
        "title": "A short guide to critical thinking",
        "description": [
            "UniOfSunLib\nSUBSCRIBE\nLearn about critical thinking, what it means at University and how to do it.\n\nPlymouth Critical Thinking Model adapted from Learn Higher Creative Commons Resources http://www.learnhigher.ac.uk/learning...\nSHOW LESS"
        ],
        "views": "14,418 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=Cum3k-Wglfw",
        "title": "CRITICAL THINKING - Fundamentals: Introduction to Critical Thinking [HD]",
        "description": [
            "Wireless Philosophy\n294K subscribers\nSUBSCRIBE\nGeoff Pynn (Northern Illinois University) gets you started on the critical thinking journey. He tells you what critical thinking is, what an argument is, and what the difference between a deductive and an ampliative argument is.\n\nHelp us caption & translate this video!\n\nhttp://amara.org/v/Fhgq/\nSHOW LESS"
        ],
        "views": "1,046,606 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=vNDYUlxNIAA",
        "title": "This tool will help improve your critical thinking - Erick Wilberding",
        "description": [
            "TED-Ed\n14.7M subscribers\nSUBSCRIBE\nExplore the technique known as the Socratic Method, which uses questions to examine a person’s values, principles, and beliefs. \n\n--\n\nSocrates, one of the founding fathers of Western philosophical thought, was on trial. Many believed he was an enemy of the state, accusing the philosopher of corrupting the youth and refusing to recognize their gods. But Socrates wasn’t feared for claiming to have all the answers, but rather, for asking too many questions. Erick Wilberding digs into the technique known as the Socratic Method.\n\nLesson by Erick Wilberding, directed by Draško Ivezić.\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/this-tool-...\nDig deeper with additional resources: https://ed.ted.com/lessons/this-tool-...\n\nAnimator's website: http://adriaticanimation.hr/\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! Amaury BISIAUX, sarim haq, Jay M, Constantino Victor Delgado, Andrea Galvagni, Andrew Tweddle, Laurel-Ann Rice, Fernando A. Endo, Courtney Marcott, Anna-Alicia Brooks, Mustafa, Helen Lee, pam morgan, Juan Pablo Rodriguez Morales, ANNE FINE, Gerardo Castro, Siddharth Toshniwal, Justice Boehmer, Michel-Ange Hortegat, Enes Kirimi,  Aravind C V, ND, Samyogita Hardikar, Vanessa Graulich, Vandana Gunwani, LvL042, Abdulmohsin Almadi, Andrew Brodski, John van den Berg, Anandha Krishnan, Geoffrey Bultitude, Mi Mi, Thomas Rothert, Christopher McVay, Izhari Ishak Aksa, Declan Manning, Javier Aldavaz, Ivan Yeung, Jaime Camacho, Irene Au, Роман Валесюк, LunarQueen, Iza, Brian Elieson, Paul, Grayson Garbarino, Oge O, Weronika Falkowska, Stefano Esposito and Nevin Spoljaric.\nSHOW LESS"
        ],
        "views": "1,743,866 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=m1_2zsXqxAk",
        "title": "Characteristics of Critical Thinkers",
        "description": [
            "Hannah Knecht\n138 subscribers\nSUBSCRIBE\nIn this session, we will be answering the guiding question: What are some characteristics of critical thinkers? And how employees can apply these characteristics to enhance their own critical thinking skills for their business, company or organization."
        ],
        "views": "4,349 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=nkqBDUyNbIc",
        "title": "Education- Critical Thinking",
        "description": [
            "OnSide Learning\n1.37K subscribers\nSUBSCRIBE\nAs educators, it is our responsibility to ensure that critical thinking takes place on an ongoing basis in the classroom. This video helps define what critical thinking is and why it is an important.\n\nFor part 2 visit www.onsided.com/lessons/critical-thinking-part-2/\nSHOW LESS"
        ],
        "views": "60,174 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=ZLyUHbexz04",
        "title": "What is Critical Thinking? A Definition",
        "description": [
            "Gary Meegan\n1.07K subscribers\nSUBSCRIBE\nMost people believe they know what critical thinking is, but they have trouble defining it. Gary Meegan uses one of Richard Paul's definitions and takes it apart, looking at what critical thinking involves and just how important it is. For an in depth look at the Elements of Thought go to: www.theelementsofthought.org.\nSHOW LESS"
        ],
        "views": "263,250 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=rn_7aJP5BTw",
        "title": "What is critical thinking? An expert psychologist tells | Psychlopaedia",
        "description": [
            "Psychlopaedia.org\n20.6K subscribers\nSUBSCRIBE\nPsychologist Diane Halpern on what critical thinking is, how this skill should be taught and why it is key to thriving in a fast-changing world \n\n\nLearn more about the science of psychology at www.psychlopaedia.org.\nSHOW LESS"
        ],
        "views": "37,102 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=1QJ2vNJPWa0",
        "title": "Develop Your Critical Thinking Skills With These Simple Exercises",
        "description": [
            "Buzzle\n24.1K subscribers\nSUBSCRIBE\nFind more exercises for developing critical thinking here: http://www.buzzle.com/articles/develo...\nThe process of thinking that involves analytical evaluation of a situation is known as critical thinking. It involves critical discrimination between different points of view on a situation, and an analysis of every possibility of solving the problem. With critical thinking, you can perform better and achieve more. It also enhances your creativity. You can also outwit others with your efficient critical thinking and problem solving skills. So how can you develop critical thinking skills? Are there any exercises that really help? Watch this video to find out right now!\nSHOW LESS"
        ],
        "views": "214,038 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=bxhPGNXAXb8",
        "title": "5 Critical Thinking Exercises for a Healthy and Alert Brain",
        "description": [
            "Critical Thinking Secrets\n59 subscribers\nSUBSCRIBE\nCritical thinking is the ability to translate complex circumstances into meaningful insights. It has become an essential skill that every individual should develop. So, how do you improve your critical thinking skills in order to become an effective thinker and problem-solver?\n\nRead more: https://criticalthinkingsecrets.com/5...\n\nResource:\nCritical Thinking: Improve your critical thinking and decision making skills: 2 Manuscripts\n\nAudiobook: Get it FREE when you try a free trial on Audible\nGet it Here: http://bit.ly/criticalthinkingaudiobook\n\nPaperback: https://amzn.to/2ICA8I0\nSHOW LESS"
        ],
        "views": "886 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=clZ7TZFVZHg",
        "title": "",
        "description": [
            "Daily dose of fact\n692 subscribers\nSUBSCRIBE\n5 Ways To Improve Your Critical Thinking Skills | critical thinking skills exercises.\n\nSubscribe to Daily Dose Of Fact - https://bit.ly/2Z4b0m0\n\n5 Ways To Improve Your Critical Thinking Skills.\n\nyou’re not simply born with innate critical thinking skills. Yes, they’re easier to acquire for some people than others, but they can in principle be cultivated in anyone. This means that if you want to be a good critical reasoner, you need to remember that becoming a critical thinking is all about practice. Imagine it as similar to physical training! There are certain muscles you need to build over time.\nThe following five exercises will all help you with the critical thinking process. They’re all about making simple but powerful changes to your cognition and monitoring them over time.\nIn addition to using these techniques, remember that any kind of new learning is equally helpful for critical thinking. Every time you read about something new, join a class or tackle a challenging book, you’re becoming a sharper, smarter thinker.\n\n1. Ask Basic Questions.\n2. Be Aware Of Your Mental Process.\n3. Adjust Your Perspective.\n4. Think In Reverse.\n5. Develop Foresight.\n\n------------------------------------------------------------------------------------------------------------------------\nFor copyright matters please contact us at: dailydoseoffact19@gmail.com \n-------------------------------------------------------------------------------------------------------------------------\nThis video is made for entertainment purposes. We do not make any warranties about the completeness, safety and reliability. Any action you take upon the information on this video is strictly at your own risk, and we will not be liable for any damages or losses. It is the viewer's responsibility to use judgment, care and precautions if one plans to replicate.\nSHOW LESS"
        ],
        "views": "724 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=0hoE8mtUS1E",
        "title": "Encourage critical thinking with 3 questions | Brian Oshiro | TEDxXiguan",
        "description": [
            "TEDx Talks\n32.4M subscribers\nSUBSCRIBE\nDo you know what kind of questions teachers and parents ask children has a great effect on whether they can develop critical minds? Brian Oshiro is a teacher evaluator, he shares what he has observed in the classrooms and offers three simple questions we can ask to encourage critical thinking of the children and ourselves.  Educator This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx\nSHOW LESS"
        ],
        "views": "244,253 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=A126c_7HFkw",
        "title": "4 Steps to Critical Thinking | Everything You Believe is WRONG",
        "description": [
            "Med School Insiders\n1.28M subscribers\nSUBSCRIBE\nIn this video, we'll go over why many of your beliefs are misled and how to critically think to figure out fact from fiction. Many of our beliefs and world perspectives are influenced by societal pressures, anecdotes, word of mouth, etc. The influence of others holds tremendous weight. \n\nLife of a Surgeon VLOG Channel: https://www.youtube.com/lifeofasurgeon\n\n0:39 Introduction\n1:40 Understanding research\n4:00 Many of your beliefs have no scientific backing\n5:04 How to think critically\n\nCritical thinking is a teachable and repeatable skill. Here are the steps\n1) Determine what is and is not important\n2) Pay attention to the right details\n3) Challenge the argument \n4) Be wary of confirmation bias\n\nResearch studies:\nBazzano et al low carb vs low fat: https://www.ncbi.nlm.nih.gov/pubmed/2...\nThe Vox on Chocolate: https://www.vox.com/science-and-healt...\nHooper et al systematic review on chocolate: http://ajcn.nutrition.org/content/95/... \n\nBecome an Insider! Visit https://patreon.com/medschoolinsiders\n\nConnect with me!\nWEBSITE: https://medschoolinsiders.com\nTWITTER: https://twitter.com/MedInsiders\nFACEBOOK: https://www.facebook.com/medschoolins...\nINSTAGRAM: https://www.instagram.com/medschoolin...\nAMAZON STORE: https://www.amazon.com/shop/medschool...\n\nMusic: http://soundcloud.com/lakeyinspired\n\nDisclaimer: Content of Med School Insiders is my opinion and does not constitute medical advice. The content and associated links provide general information for general educational purposes only.\nSHOW LESS"
        ],
        "views": "38,212 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=D-wpp64brLk",
        "title": "5 Critical Thinking Strategies",
        "description": [
            "Thoughtful Learning\n1.37K subscribers\nSUBSCRIBE\nLearn five simple strategies for teaching critical thinking in any class, at any time. Help students develop strong habits of mind to deepen their learning and engagement. Discover a critical-thinking game that combines all five strategies.\n\nLearn more at k12.thoughtfullearning.com.\nSHOW LESS"
        ],
        "views": "110,371 views",
        "category": "Critical Thinking"
    },
    {
        "link": "https://www.youtube.com/watch?v=uMFgrHXetSM",
        "title": "Critical Thinking",
        "description": [
            "newDemocracy Foundation\n405 subscribers\nSUBSCRIBE\nnewDemocracy's Research Director, Lyn Carson, was commissioned by Mosaic Lab to develop a critical thinking exercise for citizens' juries. The exercise was designed to enhance the analytical capacity of everyday citizens. It was first trialled in Hobsons Bay (Victoria) in August 2016, then in Adelaide (South Australia) in October 2016. This film was developed by newDemocracy (with creative input from Brett Hennig) and can be used as one element of the critical thinking exercise.\nSHOW LESS"
        ],
        "views": "44,746 views",
        "category": "Critical Thinking"
    }
]
