[
    {
        "link": "https://www.youtube.com/watch?v=mhfPeUKwGAs",
        "title": "Marketing - What is Personal Selling?",
        "description": [
            "The Business Professor\n11.6K subscribers\nSUBSCRIBE\nDr. Phillip Hartley explains what is Personal Selling as a part of marketing.\nSHOW LESS"
        ],
        "views": "578 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=KHXlahT1uFk",
        "title": "The concept of personal selling explain",
        "description": [
            "Knowledge World\n414 subscribers\nSUBSCRIBE\nin this video i try to explain the concept of personal selling with the help of white board animations. i hop you guys  understand the concept of personal selling.\nSHOW LESS"
        ],
        "views": "30,907 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=T5_qqqbOIHM",
        "title": "Personal Selling - Meaning - Features - Needs - Explainer Video",
        "description": [
            "Khonjel Infotainment\n93 subscribers\nSUBSCRIBE\nPersonal-selling or salesmanship are synonymous terms; with the only difference that the former term is of recent origin, while the latter term has been traditionally in usage, in the commercial world.\n\nSince a salesman, in persuading a prospect to buy a certain product, follows a personal approach; salesmanship, in the present-day-times in often popularly called as personal selling.\n\nPersonal selling (or salesmanship) is the most traditional method, devised by manufactures, for promotion of the sales of their products. Prior to the development of the advertising technique, personal selling used to be the only method used by manufacturers for promotion of sales. It is, in fact, the forerunner of advertising and other sales promotion devices.\nSHOW LESS"
        ],
        "views": "24,646 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=1N0K6RbhXkA",
        "title": "5 Ways to Sell Anything | Brian Tracy",
        "description": [
            "Brian Tracy\n1.27M subscribers\nSUBSCRIBE\nOne of the most valuable skills that a person can have is the ability to sell anything to anyone. Being a great salesperson opens up many doors of opportunity, especially for entrepreneurs and business owners. Here are a few great tips for selling to anyone. http://bit.ly/2mTRqEM\n\nDownload my FREE sales presentation template. Click the link above! \n\n\"In sales and business, the future belongs to the askers: the people who ask for what they want, over and over.\" - Brian Tracy (Click to Tweet: https://ctt.ac/Ww1b5) \n\n___\nLearn more:\n\nGive me a follow on Clubhouse! @briantracy — see you there!  \n\nSubscribe to my channel for free offers, tips and more!\nYouTube: http://ow.ly/ScHSb\nFacebook: http://www.facebook.com/BrianTracyPage\nTwitter: http://www.twitter.com/BrianTracy\nGoogle+: +BrianTracyOfficialPage\nPinterest: http://www.pinterest.com/BrianTracy\nInstagram: @TheBrianTracy\nBlog: http://bit.ly/1rc4hlg\n\nclosing techniques, marketing strategy, how to sell a product, sell anything to anyone, closing the sale, how to do sales, sales success, how to close a sale, sales techniques,\nSHOW LESS"
        ],
        "views": "83,863 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=awMOymUCgvA",
        "title": "7 Steps in Personal Selling | SALES DAILY",
        "description": [
            "Sales Daily\n14 subscribers\nSUBSCRIBE\nPersonal selling occurs when a sales representative meets with a potential client for the purpose of transacting a sale. Many sales representatives rely on a sequential sales process that typically includes seven steps.\n\nHere are the seven(7) basic steps of Personal Selling\n\nInformation source: Principles of Marketing (14th Edition) by Philip Kotler and Gary Armstrong\nPresenter: Joshua Jihan Edillon\nSHOW LESS"
        ],
        "views": "680 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=_rkgZDu0vXg",
        "title": "What is Selling and the Sales Skills Required",
        "description": [
            "The Digital Sales Institute\n872 subscribers\nSUBSCRIBE\nWhat is selling, what does it mean and what are the skills salespeople need today to perform at the top of their ability.\nNearly every sales skill that is essential for engaging buyers today can be acquired with regular sales training. The world of selling is moving fast around us, moving towards digital, moving towards soft skills and moving towards helpful consultative selling without the hard sales pitch.\nhttps://www.thedigitalsalesinstitute....\nSHOW LESS"
        ],
        "views": "318 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=y-_gc_M7kMA",
        "title": "Six Steps of Selling - DEMO",
        "description": [
            "MrYScribe\n300 subscribers\nSUBSCRIBE\nA video demonstrating the benefits of whiteboard animation and how sales training can become engaging and interesting. Visit our website www.mryscribe.com"
        ],
        "views": "12,732 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=j1QSDYStZM4",
        "title": "7 Steps to Selling Physical Products Online in 2021",
        "description": [
            "Selz\nSUBSCRIBE\nAdding something new to your product line can be a great way to bring in new customers and encourage repeat business. \n\nYou can sell physical products online like clothing, jewelry, and tech, there’s just the added layer of inventory management and fulfillment to keep in mind.\n\nThe internet is huge, and selling online means that your competition can be global in scope. One of the key ways to build a solid ecommerce strategy is finding a niche where you are competing with relatively few businesses. At the heart, it’s about finding what makes your business unique and using that to your advantage. Want more tips?\n\nThis video covers everything you need to know to start selling physical products online.\n\nReady to take your business to the next level? Sign up for a free 14-day trial and sell physical products online with Selz.\nSHOW LESS"
        ],
        "views": "12,163 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=0vg_6MoSWxc",
        "title": "How to sell online: 3 ways to get started | Small Business Guides | Xero",
        "description": [
            "Xero Accounting Software\n61.4K subscribers\nSUBSCRIBE\nWant to learn how to sell online? It’s easier than ever to get started! This video covers three ways to sell your products online: 1) build your own website and online store; 2) use an e-commerce platform like Shopify or BigCommerce; or 3) Sell on an online marketplace such as Amazon or Etsy.\n\nXero is beautiful accounting software for small businesses and their advisors. See your cashflow in real-time with online accounting, invoicing, payroll, billing & banking. Just login and see the difference. Sign up for a free trial at https://www.xero.com/signup\n\nLike us on Facebook: http://www.facebook.com/xero.accounting/\nFollow us on Instagram: https://www.instagram.com/xero/\nFollow us on Twitter: http://www.twitter.com/xero\nFollow us on LinkedIn: http://www.linkedin.com/company/xero\nSubscribe to our Youtube Channel here: https://www.youtube.com/user/XeroOnli...\n\nFor Xero product support please visit:\nhttps://www.xero.com/support\nSHOW LESS"
        ],
        "views": "8,263 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=7HTMcYfr32w",
        "title": "How to Sell a Product",
        "description": [
            "Alex Ikonn\n145K subscribers\nSUBSCRIBE\nSelling is important if you wan to succeed in business and in life really. Watch this video to learn how to sell a product. \n\nVideo inspired by http://www.useronboard.com/features-v...\n\nBRUSH YOUR MIND DAILY: http://www.fiveminutejournal.com\n\nThank you for watching! :)\n\nPlease remember to LIKE, SHARE and SUBSCRIBE for more awesome videos :)  \n\nAlex\n\nJoin me on:\nFacebook - https://www.facebook.com/AlexIkonn11\nInstagram - http://www.instagram.com/alexikonn\n\nGet The Five Minute Journal - http://www.fiveminutejournal.com\nSHOW LESS"
        ],
        "views": "482,643 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=tD-nT6C_grE",
        "title": "10 Effective Closing Requirements in Sales | Brian Tracy",
        "description": [
            "Brian Tracy\n1.27M subscribers\nSUBSCRIBE\nBefore you ask the customer to make a buying decision, there are a series of bases you must touch. Any attempt to bring the sales process to a conclusion with even one of these elements missing can cost you the sale. Learn how to increase sales with these 10 effective closing requirements. http://bit.ly/2MDlSTg\n\nSpeaking of closing requirements, download my FREE closing techniques \n\n___\nLearn more:\n\nGive me a follow on Clubhouse! @briantracy — see you there!  \n\nSubscribe to my channel for free offers, tips and more!\nYouTube: http://ow.ly/ScHSb\nFacebook: http://www.facebook.com/BrianTracyPage\nTwitter: http://www.twitter.com/BrianTracy\nGoogle+: +BrianTracyOfficialPage\nPinterest: http://www.pinterest.com/BrianTracy\nInstagram: @TheBrianTracy\nBlog: http://bit.ly/1rc4hlg\n\nsales skills, increase sales, sales tips, sales success, how to close a sale,\nSHOW LESS"
        ],
        "views": "29,925 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=PT0bkGv8DDU",
        "title": "02. Sales Process",
        "description": [
            "InfoteamConsulting\n3.82K subscribers\nSUBSCRIBE\nInfoteam Consulting: http://www.infoteam-consulting.com/\n\nGreat salespeople have many attributes which contribute to their success -- but self-reflection and the desire to be challenged are two of the most important.\nLearn about the mind set required to continuously become better in selling.\n\nCopyright: Infoteam Sales Process Consulting AG, Switzerland\nSHOW LESS"
        ],
        "views": "57,217 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=2C-2v99paQM",
        "title": "10. Understanding Customer Needs",
        "description": [
            "InfoteamConsulting\n3.82K subscribers\nSUBSCRIBE\nInfoteam Consulting: http://www.infoteam-consulting.com/\n\nBefore you can develop a value proposition, you first need to understand key stakeholder needs.\n\nWhat is each person trying to achieve with the project from a corporate perspective? Which criteria do they use to select the best vendor and solution? What personal goals need to be considered? \n\nCopyright: Infoteam Sales Process Consulting AG, Switzerland\nSHOW LESS"
        ],
        "views": "404,692 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=mrqwNC0nyos",
        "title": "Personal Selling",
        "description": [
            "Supriya Mogale\n2.93K subscribers\nSUBSCRIBE\nMeaning, activities involved in personal selling, Importance of personal selling, When is it more useful, Process of Personal Selling"
        ],
        "views": "892 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=45AILGa9iaU",
        "title": "Objectives of Personal Selling",
        "description": [
            "Unconditional Learning\n593 subscribers\nSUBSCRIBE\nUnderstand objectives of personal selling in this small video."
        ],
        "views": "73 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=L1Xycx447To",
        "title": "Sell On Amazon - Getting Started - How to Start Selling on Amazon",
        "description": [
            "Amazon Seller University\n83.1K subscribers\nSUBSCRIBE\nThis Seller University video will give you a step-by-step overview of how to sell on Amazon. Selling on Amazon can be broken down into 4 main steps:\n\n1) Creating an Amazon Seller Central account \n2) Listing products for sale on Amazon\n3) Fulfilling customer orders using different options such as Amazon FBA\n4) Receiving payments from your product sales on Amazon and maintaining your account health\n\nWhen you start to sell on Amazon, you become part of a retail destination that’s home to sellers of all kinds, from Fortune 500 organizations to artisan vendors who make handcrafted and customized goods. They all sell here for a reason: to reach the hundreds of millions of customers who visit Amazon to shop.\n\nRegister to Sell on Amazon:  https://sell.amazon.com/\nSHOW LESS"
        ],
        "views": "141,431 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=CKaEQYbjbJQ",
        "title": "Shopee Seller Education: How to start selling via the Shopee APP",
        "description": [
            "Shopee Singapore\n26K subscribers\nSUBSCRIBE\nGetting started on Shopee is quick and easy!  Simply follow the steps below to begin your selling journey, from setting up your shop via the Shopee App to tips on how to secure your first order!"
        ],
        "views": "24,581 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=lJUzh7INCZg",
        "title": "8 Undeniable Tips To Keep Customers For Life | Brian Tracy",
        "description": [
            "Brian Tracy\n1.27M subscribers\nSUBSCRIBE\nA direct sale to a customer today can cost more than $400 in terms of time, travel, advertising, lead generation, and other expenses. Acquiring a customer at this cost can put a company out of business unless that customer buys again and again. http://bit.ly/2UV1mgP\n\nCustomer loyalty is KEY. Here are some tips to help you keep customers for life, since repeat customers are the most valuable of all.\n\nTo help you keep customers for life, I've included a FREE sales presentation template. Click the link above to download! \n\n___\nLearn more:\n\nGive me a follow on Clubhouse! @briantracy — see you there!  \n\nSubscribe to my channel for free offers, tips and more!\nYouTube: http://ow.ly/ScHSb\nFacebook: http://www.facebook.com/BrianTracyPage\nTwitter: http://www.twitter.com/BrianTracy\nGoogle+: +BrianTracyOfficialPage\nPinterest: http://www.pinterest.com/BrianTracy\nInstagram: @TheBrianTracy\nBlog: http://bit.ly/1rc4hlg\n\nsales tips, selling tips, keep customers happy, customer service,\nSHOW LESS"
        ],
        "views": "21,594 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=y0OtFpC7yag",
        "title": "Strategies for Customer Retention, Customer Loyalty, and Repeat Sales | Brian Tracy",
        "description": [
            "Brian Tracy\n1.27M subscribers\nSUBSCRIBE\nThe success of any business depends heavily on the relationships it builds with its customers. In this video, I want to share some strategies for customer retention, customer loyalty, and repeat sales with you. http://bit.ly/2sh6vEX\n\nClick the link above to discover the ONE skill the very best influencers, persuaders, communicators, and salespeople all excel at, and how you can excel at it too. \n\n\"Your company’s most valuable asset is how it is known to its customers.\" @BrianTracy (Click to tweet: http://ctt.ec/X3h2E)\n\n___________________\nLearn more:\n\nGive me a follow on Clubhouse! @briantracy — see you there!  \n\nSubscribe to my channel for free offers, tips and more!\nYouTube: http://ow.ly/ScHSb \nFacebook: http://www.facebook.com/BrianTracyPage\nTwitter: http://www.twitter.com/BrianTracy\nGoogle+: +BrianTracyOfficialPage\nPinterest: http://www.pinterest.com/BrianTracy\nInstagram: @TheBrianTracy\nBlog: http://bit.ly/1rc4hlg\nSHOW LESS"
        ],
        "views": "79,229 views",
        "category": "Personal Selling"
    },
    {
        "link": "https://www.youtube.com/watch?v=41EAJomZ5Sg",
        "title": "How To Upload Your Products To Start Selling On Lazada",
        "description": [
            "Lazada University Malaysia\n1.65K subscribers\nSUBSCRIBE\nUploading products (aka SKUs) is your first step to selling online. Learn the basic steps through this video and learn more on Lazada University! Click here and upload your products now: https://bit.ly/33EtMkj\n\nLazada University has daily Livestream training talking about sales and how to sell on Lazada in English/BM & Mandarin, check our schedules here: https://bit.ly/LUSched\nSHOW LESS"
        ],
        "views": "3,250 views",
        "category": "Personal Selling"
    }
]
