[
    {
        "link": "https://www.youtube.com/watch?v=flthk8SNiiE",
        "title": "Three anti-social skills to improve your writing - Nadia Kalman",
        "description": [
            "TED-Ed\n14.7M subscribers\nSUBSCRIBE\nView full lesson: http://ed.ted.com/lessons/three-anti-...\n\nYou need social skills to have a conversation in real life -- but they're quite different from the skills you need to write good dialogue. Educator Nadia Kalman suggests a few \"anti-social skills,\" like eavesdropping and muttering to yourself, that can help you write an effective dialogue for your next story.\n\nLesson by Nadia Kalman, animation by Enjoyanimation.\nSHOW LESS"
        ],
        "views": "2,599,184 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=RSoRzTtwgP4",
        "title": "How to write descriptively - Nalo Hopkinson",
        "description": [
            "TED-Ed\n14.7M subscribers\nSUBSCRIBE\nView full lesson: http://ed.ted.com/lessons/how-to-writ...\n\nThe point of fiction is to cast a spell, a momentary illusion that you are living in the world of the story. But as a writer, how do you suck your readers into your stories in this way? Nalo Hopkinson shares some tips for how to use language to make your fiction really come alive. \n\nLesson by Nalo Hopkinson, animation by Enjoyanimation.\nSHOW LESS"
        ],
        "views": "3,476,148 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=IsDR3XEv50E&list=RDQMSgc8wEeb5UU&index=2",
        "title": "Writing - Transitions - in addition, moreover, furthermore, another",
        "description": [
            "English Lessons with Adam - Learn English [engVid]\n2.66M subscribers\nSUBSCRIBE\nhttp://www.engvid.com One of the most important tools for creating good flow in writing is the transition. Transitions are the bridges that allow a reader to move from one idea to the next without getting lost in the language. In this writing lesson, we'll look specifically at transitions to join similar, supporting ideas. I'll teach you how to use 'in addition', 'furthermore', 'moreover', 'another', and more. Take a quiz on this lesson here: http://www.engvid.com/writing-transit...\nSHOW LESS"
        ],
        "views": "1,805,403 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=9DuPmNZbKe4",
        "title": "10 impressive words to use in your next English essay!",
        "description": [
            "IGCSESuccess\n10.2K subscribers\nSUBSCRIBE\nHere are 10 impressive words you could use in an English Language task or Literature essay.\n\n#AmbitiousVocabulary #ImpressiveWords #EnglishEssay"
        ],
        "views": "22,532 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=GgkRoYPLhts&t=117s",
        "title": "5 tips to improve your writing",
        "description": [
            "Learn English with Emma [engVid]\n3.74M subscribers\nSUBSCRIBE\nWant to become a better writer? In this video, I will share five easy and quick tips that will improve writing in formal and academic settings. If you're in college or university or plan to study overseas, this video is for you! Watch the lesson, then take the quiz: https://www.engvid.com/5-tips-to-impr...\n\nNext, watch my Top 5 Writing Tips video: https://www.youtube.com/watch?v=xu2gm...\nSHOW LESS"
        ],
        "views": "8,861,661 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=G2il_3gQkQw",
        "title": "HOW TO IMPROVE YOUR WRITING SKILLS",
        "description": [
            "N I N A\n23.7K subscribers\nSUBSCRIBE\nThese are the 5 tips I always practice to improve my own writing skills. I hope that these tips would be helpful to those aspiring writers who need guidance.\n\nDownload PDF of \"KWF: Manwal  sa Masinop na Pagsulat\" here:\nhttp://kwf.gov.ph/wp-content/uploads/...\n\nDownload PDF of \"The 1987 Constitution of the Republic of the Philippines\" here:\nhttp://www.dotr.gov.ph/images/front/G...\n\nFOLLOW ME\nTwitter : @nininininaaa\nInstagram : @nininininaaa\nWattpad : @nininininaaa\n\nNo copyright infringement intended. Thank you for watching.\nSHOW LESS"
        ],
        "views": "13,259 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=jTEATmzxdro",
        "title": "How to Improve English Writing Skills (without studying grammar)",
        "description": [
            "EngFluent\n781K subscribers\nSUBSCRIBE\nIn this video, you'll learn how you can improve your written English by \"copying the way native English speakers write.\" \n\nThe writing exercise I share in this video has been used by many writers to sharpen their writing skills. It's my favorite way to practice my English writing.\nSHOW LESS"
        ],
        "views": "357,064 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=c8yvN5oOKHY",
        "title": "20 Useful Work E-mail Phrases (Advanced English)",
        "description": [
            "Wonder in English Courtney\n8.4K subscribers\nSUBSCRIBE\nDownload my e-book on the most common mistakes advanced English speakers make! \nhttps://wugenglish.lpages.co/free-e-b...\n\n---------------------------------------------------------------------\nNative English speakers know that there are a few phrases we use again and again in work e-mails. Do you want to know the \"email language\" we use? Check out this video!\n\n__________________________________________________________________\n\nIf you want more advanced English vocabulary practice, check out my podcast! I provide the transcript and define useful idioms and phrases so you can sound more like a native.\nhttps://www.wonderinenglish.com/podca...\n\nWant to practice your idioms? Join the 30 Day Idiom Challenge!\nhttps://www.wonderinenglish.com/produ...\nSHOW LESS"
        ],
        "views": "96,743 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=8E-oqahDnb8",
        "title": "The Secret to Business Writing: Crash Course Business - Soft Skills #3",
        "description": [
            "CrashCourse\n12.6M subscribers\nSUBSCRIBE\n***This series is sponsored by Google***\n\nIn business, you need to know how to write. And that involves learning a bunch of things like knowing who you're writing to and what kind of thing you're writing. In this episode of Crash Course Business Soft Skills, Evelyn talks to us about writing for business. \n\n***\n\nCrash Course is on Patreon! You can support us directly by signing up at http://www.patreon.com/crashcourse\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\n\nEric Prestemon, Sam Buck, Mark Brouwer, Bob Doye, Jennifer Killen, Naman Goel, Nathan Catchings, Brandon Westmoreland, dorsey, Indika Siriwardena, Kenneth F Penttinen, Trevin Beattie, Erika & Alexa Saur, Glenn Elliott, Justin Zingsheim, Jessica Wode, Tom Trval, Jason Saslow, Nathan Taylor, Brian Thomas Gossett, Khaled El Shalakany, SR Foxley, Sam Ferguson, Yasenia Cruz, Eric Koslow, Caleb Weeks, Tim Curwick, D.A. Noe, Shawn Arnold, Malcolm Callis, William McGraw, Andrei Krishkevich, Rachel Bright, Jirat, Ian Dundore\n--\n\nWant to find Crash Course elsewhere on the internet?\nFacebook - http://www.facebook.com/YouTubeCrashC...\nTwitter - http://www.twitter.com/TheCrashCourse\nTumblr - http://thecrashcourse.tumblr.com \nSupport Crash Course on Patreon: http://patreon.com/crashcourse\n\nCC Kids: http://www.youtube.com/crashcoursekids\nSHOW LESS"
        ],
        "views": "165,624 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=uyi7L7iKxWA",
        "title": "How To Write Professional Business Emails | Chris Guerriero",
        "description": [
            "Chris Guerriero\n15.8K subscribers\nSUBSCRIBE\nLooking for an edge to grow your business? Check out my free tools at https://www.chrisguerriero.com \n\nI’ve made a lot of money from sending business emails. In fact, the format that I’ll be sharing with you in this video recently brought in $100,000 for my business. \n\nBut I’ve also seen business owners lose money and damage their brand by sending poorly worded or badly timed emails.\n\nIn this video I’ll be sharing my best email tips and strategies for how to write and send emails that foster and build relationships rather than risk ruining them.\n\nThese rules apply for all business emails you might send, whether it’s a summary of a conversation you just had, a follow up email, trying to close a deal and anything else you can think of.\n\nMy rules:\n\n1:26 – What’s the correct email length?\n2:23 – How many topics should you cover? \n2:49 – How fast should you respond to an email?\n3:27 - Considering email tone & emotional states \n4:23 - Don’t go back and forth!\n4:48 - How to deliver bad news \n5:46 – Keep the end in mind\n\nAlways remember that communicating via email is not something to be rushed. If you want a profitable outcome, take your time, double check you’ve followed these rules, and soon enough they’ll become second nature.\n\n#businessemail #businessemailtips #businesscommunication \n\n===\n\nSUBSCRIBE TO THE CHANNEL: https://ChrisGuerriero.com/yt\n\nSchedule: New episodes at least 3x every week on a broad array of entrepreneurial topics.\n\nChris is an entrepreneur, investor, bestselling author, and business adviser to a handful of high growth companies. He has built four 8-figure companies, developed winning leadership teams across multiple industries, and designed business systems that predictably grow multi-million-dollar brands. He’s been featured in financial periodicals such as Success, Inc, Bloomberg, and in Entrepreneur as a top entrepreneur of the time.\n\nCONNECT WITH CHRIS ON SOCIAL MEDIA:\n\nBlog: https://ChrisGuerriero.com/blog\nInstagram: https://ChrisGuerriero.com/IG\nPodcast: https://ChrisGuerriero.com/IT\nLinkedIn: https://ChrisGuerriero.com/LI\n\nPlease understand that by watching Chris Guerriero's videos or enrolling in his programs does not mean you’ll get the same, similar (or really any) results. He’s been in business for over 25 years and his results are not typical. Most people who watch his videos or enroll in his programs get the “how-to” but never take action with the information. Chris is only sharing what has worked for him and his clients. Your results are dependent on many factors including but not limited to your ability to work hard, commit yourself, and do whatever it takes to succeed. Entering any business is going to involve a level of risk as well as massive commitment and action. If you're not willing to accept that, please DO NOT WATCH CHRIS' VIDEOS OR SIGN UP FOR ONE OF HIS PROGRAMS.\nSHOW LESS"
        ],
        "views": "8,666 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=yCf3pXuyy6g",
        "title": "Write like a pro – 3 easy tips used by professional writers",
        "description": [
            "Laura Randazzo\n33.7K subscribers\nSUBSCRIBE\nHigh School English – Episode #51\nWant to improve your English reading and writing skills? I’m here to help! My name’s Laura Randazzo and I’m a high school English teacher with more than 20 years of experience. I’ll be here three times a week this academic year to share lessons on the following:\nMondays = Mechanics, usage, and grammar (MUG shot Mondays)\nWednesdays = SAT-level vocabulary (Words on Wednesdays)\nFridays = A wide range of skill builders  (Freestyle Fridays) \n\nNeed the sentence starters from last week’s video? Click here:\nhttps://youtu.be/JW1n7jgToI4\n\nWant to use this lesson in your own classroom? Grab a copy here:\nhttps://www.teacherspayteachers.com/P... \n\nLots of advice and free resources for secondary teachers at https://laurarandazzo.com/\n\nMusic used with permission:\n\"Werq\" by Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 3.0 License\nhttp://creativecommons.org/licenses/b...\n\nApple, bell, and thumbs-up image credit: Pixabay, Public domain\nSHOW LESS"
        ],
        "views": "4,287 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=fyKTZs5Unpo",
        "title": "Being a Professional Writer",
        "description": [
            "GCFLearnFree.org\n775K subscribers\nSUBSCRIBE\nIn this video, you’ll learn more about what being a professional writer looks like. Visit https://edu.gcfglobal.org/en/career-e... for our text-based lesson.\n\nWe hope you enjoy!\nSHOW LESS"
        ],
        "views": "28,250 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=UAvcu1mYqMo",
        "title": "6 classic tips for Professional Writing | Content Writer",
        "description": [
            "Purpleora\n146 subscribers\nSUBSCRIBE\nDo you wonder, how to write professionally with full authority?\nHere are some content writing tips for you either for your business work or simple day to day email writing.\n\n\nDo subscribe if you find these tips useful!\nKeep Smiling :)\nSHOW LESS"
        ],
        "views": "101 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=uo_4rJRA3og",
        "title": "Four Keys to Effective Business Writing",
        "description": [
            "GreggU\n75.6K subscribers\nSUBSCRIBE\nThe purpose of effective writing at work is always to accomplish a specific goal and to be as persuasive as possible. Effective writing on the job is carefully planned, thoroughly researched, and clearly presented. \n\nKnowing who makes up your audience is one of your most important responsibilities as a writer. Keep in mind that you are not writing for yourself but for a specific reader or group of readers. Expect to analyze your audience throughout the com- posing process.\n\nThe tone of your writing is especially important in occupational writing because it reflects the image you project to your readers and thus determines how they will respond to you, your work, and your company. Depending on your tone, you can appear sincere and intelligent or angry and uninformed.\nSHOW LESS"
        ],
        "views": "18,001 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=hTZhD9tBaM4",
        "title": "The Basic Principles in Business Writing",
        "description": [
            "Efi Dyah Indrawati\n74 subscribers\nSUBSCRIBE\nPre-writing Planning and 12 Basic Principles in Business Writing"
        ],
        "views": "633 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=FhA8TC1KeCo",
        "title": "Creating A Style Guide & Voice - Business Writing & Grammar",
        "description": [
            "docstocTV\n48.1K subscribers\nSUBSCRIBE\nClick here for full course playlist:http://www.youtube.com/playlist?featu...\n\n\nGood writing is one of the most neglected but critical ingredients for business success. Bad writing can compromise the effectiveness of your marketing campaigns and risk your relationship with customers, clients and employees. Great writing, however, has the power to not only make an excellent first impression, but to persuade people to listen to you. This \ncourse will walk you through everything you need to know in order to improve your advertisements, Facebook and twitter posts, email\nnewsletters, B2B communications, business proposals and much more. It will also address the most common grammatical errors that professionals make, and how to correct them.\n\n\nFor more information and resources, be sure to check out \nhttp://www.docstoc.com.\n\nThere you'll have access to an array of valuable tools to help you start and grow a business.\n\n\nAnd for additional video courses, check out\nhttp://www.docstoc.com/courses\nSHOW LESS"
        ],
        "views": "26,086 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=_BAoLleYjew",
        "title": "Five Rules to Make Your Writing Style Formal",
        "description": [
            "Master IELTS\n9.77K subscribers\nSUBSCRIBE\nWhen you write essays, it is essential to make your writing style look formal. That is why, in this video, we would like to introduce five rules you should follow to make your essay impressive."
        ],
        "views": "563 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=rSRx6K0K9qM",
        "title": "ACADEMIC WRITING AND PROFESSIONAL WRITING",
        "description": [
            "Jeston E.\n1.15K subscribers\nSUBSCRIBE\nThis is a learning material for my writing class."
        ],
        "views": "2,343 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=vHqmleMKWgg",
        "title": "Editing And Proofreading | Creative And Professional Writing Skills",
        "description": [
            "Creative And Professional Writing Skills\n166 subscribers\nSUBSCRIBE\nWrite to impress by learning Editing and Proofreading.. A good write up shows your prowess and command on the language... Write, revise, edit, repeat."
        ],
        "views": "4,255 views",
        "category": "Professional Writing"
    },
    {
        "link": "https://www.youtube.com/watch?v=LNzdGACMvw4",
        "title": "Writing like a Pro",
        "description": [
            "McMasterUTV\n8.88K subscribers\nSUBSCRIBE\nHere are some tips that will help you strengthen and develop your writing skills. Follow these tips and you'll be able to write like a pro in no time!"
        ],
        "views": "634 views",
        "category": "Professional Writing"
    }
]
